Q1. List any five functions of the pandas library with execution.

A1. the five functions of pandas are :

 -> Categorical(): it devides  the series in unique categories of any  dataframe

 -> unique() : it gives the  the unique value of any series in dataframe

-> head() : it prints the top five rows of dataframe

 -> tail() : it prints the bottom five values of dataframe

-> iloc() : it is used to print any specific values of any rows and columns

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
pd. Categorical(df['Sex'])

['male', 'female', 'female', 'female', 'male', ..., 'male', 'female', 'female', 'male', 'male']
Length: 891
Categories (2, object): ['female', 'male']

In [6]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [15]:
df.iloc[4:9,[3,4,5]]

                                                Name     Sex   Age
4                           Allen, Mr. William Henry    male  35.0
5                                   Moran, Mr. James    male   NaN
6                            McCarthy, Mr. Timothy J    male  54.0
7                     Palsson, Master. Gosta Leonard    male   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [34]:
import pandas as pd

def reindex_dataframe(df):
    new_index = pd.RangeIndex(start=1, stop=len(df.columns) * 2, step=2)
    df = df.reindex(new_index)
    return df

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [38]:
import pandas as pd

def val_sum(df):
    a=df['Values'][0]
    b=df['Values'][1]
    c=df['Values'][2]
    print(a+b+c)

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [41]:
import pandas as pd

def words_count(df):
    df['Word_Count']=0
    for i in range(len(df['Text'])):
        df.loc[i,['Word_Count']]=len(df['Text'][i])
    return df

Q5. How are DataFrame.size() and DataFrame.shape() different?

A5. the DataFrame.size() method returns the total number of elements in a DataFrame, which is equivalent to the number of rows multiplied by the number of columns. On the other hand, the DataFrame.shape() method returns a tuple representing the dimensionality of the DataFrame, i.e., the number of rows and columns.

Q6. Which function of pandas do we use to read an excel file?

A6. read_excel(file_name) function is used to read an excel file

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [42]:
import pandas as pd

def user(df):
    df['Username']=0
    for i in range(len(df['Email'])):
        email=df.loc[i,['Email']]
        name = email.split('@')[0]
        df.loc[i,['Username']] = name
    return df

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [44]:
import pandas as pd 

def select(df):
    z=df[(df['A'] > 5) & (df['B'] < 10)]
    return z

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [45]:
import pandas as pd

def calculate_statistics(df):
    values_column = df['Values']
    z=df['Values'].describe()
    mean=z['mean']
    std_dev=z['std']
    median=values_column.median()
    print(f"MEAN = {mean} , MEDIAN = {median} , STANDARD_DEVIATION = {std_dev}")

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [46]:
import pandas as pd

def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [48]:
import pandas as pd

def select_rows_between_dates(df):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df.loc[mask]
    return selected_rows

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

A13. To use the basic functions of pandas, pandas is the first and foremost necessary library that needs to
be imported.